[
    {
        "event": "Britain’s richest family sentenced to jail for exploiting staff in Swiss mansion",
        "speaker_summary": "Britain’s richest family, the Hindujas, were sentenced to jail for exploiting staff in their Swiss mansion. Prakash Hinduja and his wife received four years and six months, while their son and his wife got four-year sentences.",
        "duration": 16,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141524.mp3",
        "comments": [
            "Imagine having billions of dollars and not wanting to pay people. What the hell is wrong with people.",
            "A fortune of 37B, and wind up in court for basically having indentured servants…",
            "Slaves. They had slaves.",
            "Good. That's fucked up. Should lose a large portion of their shit as compensation.",
            "Prakash Hinduja and his wife, Kamal, were each sentenced to four years and six months in prison, and their son Ajay and his wife, Namrata, received four-year terms.\n\nNice"
        ],
        "impact": {
            "human_impact": 3,
            "economic_impact": 3,
            "environmental_impact": 1,
            "social_impact": 5,
            "health_impact": 2,
            "infrastructure_impact": 1
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "The event involves high-profile individuals, specifically Britain's richest family.",
                "The case highlights issues of labor exploitation and legal consequences for the wealthy.",
                "Garnered public attention and reactions due to the disparity between the family's wealth and their treatment of staff."
            ]
        }
    },
    {
        "event": "Man Exonerated After Spending 45 Years in Virginia Prison for Death of Toddler",
        "speaker_summary": "A man has been exonerated after spending 45 years in a Virginia prison for the death of a toddler. New research revealed Grimm's DNA was not present, leading to his release after decades of wrongful imprisonment. The actual perpetrator remains unidentified.",
        "duration": 19,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141529.mp3",
        "comments": [
            "https://www.latimes.com/california/story/2024-06-01/fontana-police-coerced-false-murder-confession-with-lies\n\nFalse confessions are way more common than people think. I hate it took 45 years, but I’m glad this guy is finally free",
            "> Grimm, who was married, and had his first child 10 days before his arrest, The New York Times reported.\n\n> In December 1975, a month after the boy was found, cops arrested Grimm and he confessed to the crime, according to reports.\n\n> Through new research, none of the hairs belonged to the victim but came from several people. Grimm’s DNA was nowhere to be found in swabs from the victim’s body, The New York Times reported.\n\nThis whole story is awful.",
            "It’s incredible that you get one life; a single chance at conscious existence in the universe, and a single fucked up person can just ruin the entire thing despite no wrong doing of your own.",
            "No way to reel in the years, but I hope he gets many millions for his trouble.",
            "> Forensic experts at the time told the police that the toddler had semen in the back of his throat and determined that he had been strangled during a sexual assault. Alcohol and a muscle relaxant were found in his blood, according to court documents \n\nWtf??? Wait wait… so if Grimm went to jail for the crime, does that mean the case was closed and the person who did this to a 3 year old is still out there???????!"
        ],
        "impact": {
            "human_impact": 5,
            "economic_impact": 3,
            "environmental_impact": 1,
            "social_impact": 5,
            "health_impact": 3,
            "infrastructure_impact": 2
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "The event highlights significant issues related to wrongful imprisonment and the justice system.",
                "The exoneration after 45 years underscores the importance of advancements in forensic science, particularly DNA testing.",
                "The emotional and social ramifications are notable, given the public's reaction and concerns about the real perpetrator remaining unidentified."
            ]
        }
    },
    {
        "event": "New Colorado law will ban sales of dental floss, clothes, & other household products containing toxic \"forever chemicals\"",
        "speaker_summary": "A new Colorado law will ban the sale of dental floss, clothes, and other household products containing toxic \"forever chemicals.\" Critics warn the law may increase consumer costs, but the phase-out period aims to give industries time to create safer alternatives.",
        "duration": 19,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141533.mp3",
        "comments": [
            "How is that shit allowed in dental floss?",
            "Dental floss has forever chemicals? Im confused.",
            "Hmm cost of a product or cost of cancer care hmm",
            "However, some critics warn the new state law may only end up increasing consumer costs in other areas. Asked about those concerns, Cutter says that the law will provide plenty of time in a phase out for industries to create safer products. \n\n\"It's really hard coming up against a powerful lobby, and they spent a lot of money ensuring that these chemicals can continue being put into our products and make profits for these companies,\" Cutter said. \"We took comment from a lot of people and some companies flew people in from all over the world to lobby because, you know, (they claim) we're stifling innovation, we're stifling industry, but I think we're smarter and better than that. I think you can have both things. I think you can have a successful company, and you can also look out for the communities that you serve. I think there are alternatives, and I have faith that we're going to be able to continue developing those.\"\n\nEither way, Chittoor feels laws like these are critical to protect our future because if kept unchecked, these practically indestructible chemicals will only continue to build up in our environment and our bodies.",
            "Floss has forever chemicals? I knew my laziness would save me!!"
        ],
        "impact": {
            "human_impact": 2,
            "economic_impact": 3,
            "environmental_impact": 5,
            "social_impact": 3,
            "health_impact": 4,
            "infrastructure_impact": 2
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "The event pertains to regulatory changes at the state level (Colorado) that may not immediately impact all regions.",
                "Involves common consumer products (dental floss, clothes, household items) which raises public interest and concern.",
                "Focuses on the issue of toxic 'forever chemicals,' which are increasingly becoming a point of environmental and health awareness."
            ]
        }
    },
    {
        "event": "5 men convicted for Jetflicks, illegal streamer with more content than Netflix, Hulu and Amazon combined",
        "speaker_summary": "Five men were convicted for operating Jetflicks, an illegal streaming service with more content than Netflix, Hulu, and Amazon combined. The convictions highlight the scale of illicit online streaming and its legal consequences.",
        "duration": 16,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141537.mp3",
        "comments": [
            "I’m upset I didn’t know about this already.",
            "Whenever there's news about a site like this, all the similar sites get a bump in traffic from people who previously didn't know such sites exist. It cracks me up.",
            "jfc. One of them is facing 48 years when many violent criminals get a fraction of that if anything.",
            "Every time an illegal streaming site goes down, I light a small candle in hopes that it will rise from the ashes tenfold",
            "Now go after health insurers, waste of budget for the DoJ here."
        ],
        "impact": {
            "human_impact": 1,
            "economic_impact": 2,
            "environmental_impact": 1,
            "social_impact": 2,
            "health_impact": 1,
            "infrastructure_impact": 1
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "The event is related to a significant online piracy case, affecting multiple major streaming services.",
                "Involves legal consequences and highlights the scale of illegal streaming operations.",
                "Triggers discussions about the legal system and its priorities."
            ]
        }
    },
    {
        "event": "‘Multiple disasters all in one day’: New Mexico’s brutal week of fire and flood",
        "speaker_summary": "New Mexico experienced multiple disasters in one week with severe wildfires and flash flooding. Residents faced tornado attempts, 80mph winds, and extensive power outages. The region grapples with significant damage to infrastructure and prolonged outages.",
        "duration": 20,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141542.mp3",
        "comments": [
            "I’m in San Juan County and we had a tornado attempt to form yesterday afternoon. 80mph winds were reported, a flash flood washed out a highway and destroyed multiple power line poles. I’m going on 24 hours without any access to electricity and looking at another 8 as they try to fix everything. I have nowhere to go so for now I’m hunkered down.",
            "Anyone else think we are in a slow moving apocalypse",
            "Fire AND flooding? It's a cursed place.\n\nBut at least it isn't Cleveland, where the water lit on fire, once upon a time.",
            "Thank God climate change isn't real or people would start getting worried that this would be happening more often",
            "Ah jeez, Rick, maybe we should like, do something about the climate crisis? You know, people are dying and stuff. Maybe there's a way to fix it?\n\nThat's beneath me, Morty. These people can fix it on their own, they have options. They *choose* to ignore it. At a certain point you let dumb children face the consequences of their choices. I have bigger things to be worried about."
        ],
        "impact": {
            "human_impact": 6,
            "economic_impact": 5,
            "environmental_impact": 6,
            "social_impact": 5,
            "health_impact": 5,
            "infrastructure_impact": 7
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "The event involves severe weather conditions impacting a specific region (New Mexico) with significant local consequences.",
                "Multiple types of disasters (wildfires, flash flooding, tornado attempts) occurring within a short span have raised awareness within the community.",
                "The impact on infrastructure, prolonged power outages, and localized firsthand accounts contribute to the heightened awareness but may not have garnered widespread national or international attention."
            ]
        }
    },
    {
        "event": "Reddit wants to fund an environmental impact program. Have ideas or want to organize something yourself?",
        "speaker_summary": "Reddit is offering to fund an environmental impact program and seeks ideas or organizers. Suggestions include collaborations with university entomology departments, educational games for kids, joining The Conservation Alliance, funding sustainability managers, and distributing native wildflower seeds to boost insect biodiversity. \n\nMore details can be found [here](https://www.reddit.com/r/environment/comments/17fm7nl/reddit_wants_to_fund_an_environmental_impact/).",
        "duration": 42,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141553.mp3",
        "comments": [
            "Getting kids and the entomology departments of universities to work together to raise and release helpful/endangered insects.",
            "Perhaps a game for middle school kids\n\nUse the same societal effect that got the recycling movement off the ground and firmly entrenched\n\nAs most households have some low lying fruit to positively impact their  environmental footprint \n\nPut points for each item and then use game theory to incentivize actions\n\nGo through each category and list as many items as possible\n\nBranch out to bonus rounds with watershed cleanups, park cleanups, beach cleanups, and then even add things like some of the citizen scientist projects directly to the app/game - maybe a bird photo daily for a week\n\nGraphics would be colorful - imagine magic school bus but with an interactive outcome that yields points the kids can earn \n\nGroup play is encouraged but not required \n\nComplexity would grow over time like Pokémon go did\n\nLook at each scientific branch and incorporate various items\n\nAir quality\nWater \nSoil\nWaste \nEtc\n\nExpand it out further into the game.  Like a Pokémon type game there’s multiple routes to success.  Each middle schooler would get to focus on the things easiest to accomplish in their household, thus the biggest return on effort \n\nAnd some items would be knowledge based, some action based.\n\n\nPartner with various groups\n\nSuch as ask the Smithsonian to offer a special recognition for anyone who earns it type thing, reach out to every organization that would potentially offer recognition \n\nLots of ways to go with this idea\n\nBut basically, if a middle school kid comes home and helps address things, the adults focus on it too",
            "It should join The Conservation Alliance.  \n\n\nTCA is an alliance of more than 270 businesses (including some big ones like Flickr, Patagonia, REI, etc.) that makes grants and advocates on behalf of land conservation. TCA business members visit Washington for citizen lobbying, fund grassroots organizing and more. Great organization. [https://conservationalliance.com/](https://conservationalliance.com/)",
            "Fund sustainability managers in local governments that want to transform, but which have no dedicated staff to manage it. In the US these are usually growing, smaller city governments or mid-sized counties with poor environmental records but swinging towards progress, often with some long-incumbent Republicans still in leadership but battling with upstart Democrats who are trying to fund changes. The usual turning point is when a sustainability manager is finally hired, who then inventories greenhouse gas emissions and natural assets, applies for grants to address needs, and begins to build local momentum.",
            "We could get a distribution of native wildflower seeds to community members. Flying pollinators do not need their habitat and food sources to be all concentrated in one place. If 12 redditors in the same county plant the same seed collection in a decentralized space (dirt patches all around the county), you’d see a significant percentage increase in insect biodiversity. Especially if the plants chosen bloom in sequence instead of all at the same time. \n\nIf this idea has support, I can spearhead it (along with anyone who wants to help). I am aware of some seed suppliers who have regionally tailored blends."
        ],
        "impact": {
            "human_impact": 2,
            "economic_impact": 3,
            "environmental_impact": 4,
            "social_impact": 3,
            "health_impact": 1,
            "infrastructure_impact": 1
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "The topic is focused on environmental impact, which is relevant but not currently a major global crisis.",
                "Engagement is primarily within the Reddit community, though proposals have potential for broader impact.",
                "Comments and suggestions show active participation and interest in practical environmental solutions."
            ]
        }
    },
    {
        "event": "Billions of people just felt the deadly intensity of climate-fueled heat waves",
        "speaker_summary": "Billions experienced deadly, climate-fueled heat waves, highlighting the urgent need for action. Without intervention, future years promise even more extreme temperatures on a planet with diminishing natural ice reserves. The sixth mass extinction is underway.",
        "duration": 19,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141558.mp3",
        "comments": [
            "Please keep this in mind, unless we take extraordinary action, this will be one of the coldest years of the rest of your lives.\n\nNot only will it get hotter than before, it will get hotter on an eroded planet, with much less    Glacier ice, sea ice and permafrost.\n\nThe sixth mass extinction is well under way.\n\n\nLiars keep deceiving the world into inaction. Their plan to end western democracy and establish tyrannies that will keep them in power while the world crumbles around  us.\n\nIf democracy survives, we must make sure these liars do not further profit from their destructive lies. They should pay for their crimes.",
            "And it will never ever again be cooler for those on earth today.",
            "I think this will be the year i sell and move to colder climes",
            "Bypass paywall https://archive.is/4p7Wb",
            "And yet 3/4's of those \"billions\" don't believe in climate change and still beieve in a sky daddy wish giver."
        ],
        "impact": {
            "human_impact": 8,
            "economic_impact": 7,
            "environmental_impact": 8,
            "social_impact": 7,
            "health_impact": 8,
            "infrastructure_impact": 6
        },
        "exposure": {
            "awareness": 9,
            "awareness_bullet_points": [
                "The topic has a wide-reaching, global impact, affecting billions of people.",
                "Highlights critical environmental and health crises linked to climate change, such as extreme temperatures and the sixth mass extinction.",
                "Emphasizes the urgency for immediate climate action to mitigate future devastating effects."
            ]
        }
    },
    {
        "event": "Neil Gorsuch calls out Supreme Court for upending 100 years of precedent",
        "speaker_summary": "Justice Neil Gorsuch criticized the Supreme Court for overturning a century of precedent. This comment has sparked a debate, with critics pointing out perceived inconsistencies in his stance, especially regarding the Roe v. Wade decision.",
        "duration": 17,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141562.mp3",
        "comments": [
            "He’s such a hypocrite. What, ending 50 years of Roe was okay somehow?",
            "And here they are:    \nTrump appointed SCOTUS Justice seats:\n\n1\tNeil Gorsuch     \n2\tBrett Kavanaugh    \n3\tAmy Coney Barrett",
            "The guy occupying the stolen supreme court seat has opinions?",
            "Neil's argument is not only weak and hollow, but actively goes against protecting native Americans that so many claim he advocates for. \n\nStates rights was a terrible argument here.",
            "you motherfuckers better vote in november. it's very that possible 2 more seats are available during the next presidential term"
        ],
        "impact": {
            "human_impact": 2,
            "economic_impact": 2,
            "environmental_impact": 1,
            "social_impact": 4,
            "health_impact": 1,
            "infrastructure_impact": 1
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "The subject involves a significant judicial figure criticizing the Supreme Court, which is a notable event in the context of U.S. law and politics.",
                "The issue touches on major legal precedents and controversial decisions, including Roe v. Wade, generating considerable public discourse.",
                "The comments have sparked debates on judicial consistency and the political dynamics within the Supreme Court."
            ]
        }
    },
    {
        "event": "‘My body can’t take it’: Brutal nighttime temperatures give Delhi residents little respite from India’s searing heatwave ",
        "speaker_summary": "Delhi residents are struggling with brutal nighttime temperatures during India's searing heatwave, offering little relief even after dark. The extreme heat has taken a toll, with at least 70 heat-related deaths in the past 10 days.",
        "duration": 17,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141567.mp3",
        "comments": [
            "We are currently in chapter 1 of Ministry for the Future. Really wish we were in the later ones instead.",
            "Just imagine trying to sleep when it's 100° at midnight and you have no AC...",
            "Thank your fossil fuel companies and their lackeys in government ",
            "Edit: Added links\n\nThe national paper here in Delhi has been pretty doomsday-esque the last couple of days. (Well, one of them). [Heat related death toll crosses 70](https://www.newindianexpress.com/cities/delhi/2024/Jun/20/delhi-heatwave-claims-70-lives-in-10-days), [10 die from floods in east India](https://www.indiatvnews.com/news/india/assam-continues-to-reel-under-severe-floods-death-count-reaches-27-around-4-lakh-people-affected-major-rivers-overflowing-2024-06-21-938131#), [forest fires still raging in northern India (hills)](https://www.hindustantimes.com/india-news/heatwave-dry-conditions-push-uttarakhand-forest-fires-to-new-high-101718824808777.html) the state has been on fire for months, MONTHS, [fire fighters forced to work with outdated equipment](https://www.hindustantimes.com/india-news/forest-fires-vs-shrubs-rakes-archaic-tools-no-training-exacerbate-uttarakhand-crisis-101718907217862.html) (a sickle and a bunch of dried twigs). \n\nFwiw, rains came earlier today, Saturday and temps have dipped considerably. Although, they are saying that a milder heat wave will return next week before relenting to the monsoon in month end.",
            "It's always fun googling the Baghdad forecast.\n\n\nIt's gnarly."
        ],
        "impact": {
            "human_impact": 4,
            "economic_impact": 3,
            "environmental_impact": 2,
            "social_impact": 4,
            "health_impact": 4,
            "infrastructure_impact": 2
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "The event focuses on extreme weather conditions affecting a major global city (Delhi).",
                "Highlights the severe human impact with at least 70 heat-related deaths within a short period.",
                "Discussions reflect broader concerns about climate change and inadequate infrastructure to handle such crises."
            ]
        }
    },
    {
        "event": "Everything’s About to Get a Hell of a Lot More Expensive Due to Climate Change • Intensifying hurricanes, floods, and heat waves are wreaking havoc across the US—and on everyone’s bank accounts.",
        "speaker_summary": "Intensifying hurricanes, floods, and heat waves are driving up costs across the US due to climate change. As these natural disasters become more frequent, the financial impact on households continues to grow.",
        "duration": 15,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141571.mp3",
        "comments": [
            "Not to mention corruption, lack of consumer protection, price gauging… all these influences will be exploited to squeeze those who aren’t in the owner class. ",
            "And that's at 1.5°C ... good luck with 3°C+!",
            "Don't we throw like 30% of daily food resources away?",
            "Hey, more profits!"
        ],
        "impact": {
            "human_impact": 6,
            "economic_impact": 7,
            "environmental_impact": 6,
            "social_impact": 7,
            "health_impact": 5,
            "infrastructure_impact": 6
        },
        "exposure": {
            "awareness": 9,
            "awareness_bullet_points": [
                "The topic's direct impact on daily lives and household finances resonates with a broad audience.",
                "Covers a range of climate-related natural disasters affecting a significant portion of the US population.",
                "Highlights the increasing financial burden due to climate change, a pressing and widely-discussed issue."
            ]
        }
    },
    {
        "event": "A new government policy will finally force oil and gas companies to think about their pollution: 'This is a critical milestone'",
        "speaker_summary": "A new government policy is set to compel oil and gas companies to address their pollution, marking a critical milestone in environmental regulation. More details available on Yahoo News.",
        "duration": 15,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141575.mp3",
        "comments": [
            "Think about it? Cooooooool",
            "A company is going to think or is going to use a simple calculator to make the most profitable choice? "
        ],
        "impact": {
            "human_impact": 1,
            "economic_impact": 2,
            "environmental_impact": 4,
            "social_impact": 3,
            "health_impact": 3,
            "infrastructure_impact": 2
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "The policy represents a significant step in environmental regulation for the oil and gas industry.",
                "Public reaction indicates a mix of skepticism and mild approval.",
                "The topic has broader implications for corporate responsibility and compliance with environmental standards."
            ]
        }
    },
    {
        "event": "Zelensky reportedly says Farage 'infected by Putinism' as Reform leader doubles down on Ukraine comments",
        "speaker_summary": "Ukrainian President Zelensky reportedly accused Nigel Farage of being \"infected by Putinism\" as Farage doubled down on controversial comments about Ukraine. Farage has faced criticism for his previous promotion on Russian media and his stance on Brexit.",
        "duration": 19,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141580.mp3",
        "comments": [
            "The dude was promoted on RT back in the day, he's been infected by the Putin virus his whole career.",
            "Farage isn't just infected, he's a super spreader.",
            "He’s got some balls even showing his face after how well Brexit has gone. Complete Russian puppet",
            "Brexit was always about weakening the west. It was a great victory for Russia.  \n  \nThis guy is a straight up traitor",
            "Nigel ( and his followers) is mostly infected by stupidity"
        ],
        "impact": {
            "human_impact": 2,
            "economic_impact": 3,
            "environmental_impact": 1,
            "social_impact": 4,
            "health_impact": 2,
            "infrastructure_impact": 1
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "Involves high-profile political figures (Zelensky and Farage) which draws public and media attention.",
                "Touches on broader geopolitical themes, such as Russian influence and Brexit.",
                "Engages a specific segment of the population, particularly those interested in political discourse and international relations."
            ]
        }
    },
    {
        "event": "Single men in South Korea outnumber single women by 19.6 percent: Report",
        "speaker_summary": "A report reveals that single men in South Korea outnumber single women by 19.6 percent, partly due to sex-selective practices in the past. This imbalance is prompting some Korean men to marry women from Southeast Asia.",
        "duration": 17,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141584.mp3",
        "comments": [
            "So, for every 20 single women there are 24 single men.",
            "Whats the reason for this?",
            "In 80-90s, like many other Southeast Asian countries, South Korea had the \"abortion boom\" in which they selectively bore male babies. The sex ratio is rediculously lob-sided to male at the age of 28~38 if you can have a look at the population pyramid.",
            "There is a thing where Korean men in the countryside get mailorder brides from Southeast Asia like Vietnam, Philippines, Thailand. Immigration is one way to solve this gender imbalance, population issue",
            "Korean men have started marrying Vietnamese women."
        ],
        "impact": {
            "human_impact": 2,
            "economic_impact": 3,
            "environmental_impact": 1,
            "social_impact": 4,
            "health_impact": 2,
            "infrastructure_impact": 1
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "The topic addresses a significant demographic and social issue within South Korea.",
                "Highlights historical practices affecting current population imbalances.",
                "Affects regional marriage trends and immigration patterns."
            ]
        }
    },
    {
        "event": "Nigel Farage has doubled down on his claims that the West provoked Russia's invasion of Ukraine after he was slammed by rivals Rishi Sunak and Sir Keir Starmer for the comments.",
        "speaker_summary": "Nigel Farage has reiterated claims that the West provoked Russia's invasion of Ukraine, drawing criticism from rivals Rishi Sunak and Sir Keir Starmer. Farage's comments continue to stir debates about NATO and EU expansion's role in the conflict.",
        "duration": 18,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141589.mp3",
        "comments": [
            "Farage:  \"I simply don't understand why they call me a Russian stooge?\" ",
            "He really seems to think this pro-Russia strategy will work well for his party at the voting booth.\n\nI doubt it will push his party above the 20% they are currently polling at.",
            "Farage:\n\n\"I was predicting Ukraine since 2014.\"\n\nYup and my grandfather was predicting WW2 since 1939...",
            "The only concrete political effect of Russia's invasion so far is the *expansion* of NATO, just like every expert worth a damn predicted. \n\nEither Putin is an idiot or it had nothing to do with NATO.",
            "I've never understood the whole \"NATO/EU shouldn't have expanded\" argument. Why should the EU and NATO deny membership to independent countries who wish to seek an alliance with western nations? \n\nYes, NATO and EU expansion is cited as a cause for Russias invasion but are you seriously suggesting that we should deny sovereign nations to choose their own path just because Russia don't like it?\n\nYou can't just deny the wishes of millions of citizens just because Russia say no. The Kremlin shouldn't have to power to decud the future of all of eastern Europe."
        ],
        "impact": {
            "human_impact": 6,
            "economic_impact": 6,
            "environmental_impact": 2,
            "social_impact": 6,
            "health_impact": 4,
            "infrastructure_impact": 7
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "The topic involves a high-profile political figure making contentious claims about a major international conflict.",
                "There is significant public interest and debate, reflected in the comments.",
                "The discussion touches on key geopolitical issues like NATO and EU expansion."
            ]
        }
    },
    {
        "event": "Putin threatens to arm North Korea, warns U.S. ally South against 'big mistake'",
        "speaker_summary": "Russian President Vladimir Putin has threatened to arm North Korea and warned U.S. ally South Korea against making a \"big mistake.\" This comes amid heightened tensions over military support in the region.",
        "duration": 14,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141593.mp3",
        "comments": [
            "Or what? Ya gonna sign a defense pact with North Korea and give them all the technical assistance they want?\n\nYou blew that wad. Now there is no reason for South Korea to not to advertise to the world how badass their export arms are.",
            "Putin can't even arm Russia",
            "Doubt Putin has actual equipment to spare so he must be threatening to further enhance North Korea spy satellite capability’s and precision guidance systems for missiles. \n\nGuaranteed to make Seoul and japan  very very angry and arguably more dangerous than Putin sending over actual equipment tbh.",
            "I think he actually wants to sell them Nukes for quick cash. It’s that bad.",
            "LOL, arm them with what, loser? You're tapped out."
        ],
        "impact": {
            "human_impact": 3,
            "economic_impact": 4,
            "environmental_impact": 2,
            "social_impact": 5,
            "health_impact": 2,
            "infrastructure_impact": 3
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "Involves major geopolitical players (Russia, North Korea, and South Korea) and has implications for regional security.",
                "Discussion about potential military and technological support to North Korea raises significant concerns.",
                "The comments reflect skepticism and fear regarding the actual impact and possible escalation of tensions."
            ]
        }
    },
    {
        "event": "Greece introduces the six-day work week",
        "speaker_summary": "Greece has introduced a six-day work week, sparking reactions and concerns among the public. Critics worry about increased work hours without proportional pay raises and potential economic impacts on the tourism sector.",
        "duration": 15,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141597.mp3",
        "comments": [
            "This isn't what people wanted when they asked for changes to the 5 day work week..",
            "Does that mean you get 20% more salary?",
            "coming soon:  the eight-day work week",
            "How are they not taking to the streets?",
            "Greece’s top revenue source is tourism. Wages are exuberantly low, hours are long, tourists are idiots. Sure you can get some olive oil and wine, but tourist traps are the first to die and last to recover."
        ],
        "impact": {
            "human_impact": 4,
            "economic_impact": 3,
            "environmental_impact": 1,
            "social_impact": 5,
            "health_impact": 4,
            "infrastructure_impact": 1
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "The policy change affects the daily lives and work conditions of Greek citizens.",
                "Generated mixed reactions, highlighting public concerns about longer work hours and insufficient pay increases.",
                "Potential implications for Greece's tourism sector and overall economic health."
            ]
        }
    },
    {
        "event": "Ukraine's partisans claim infiltration of Russian air base, leave 'surprises' for pilots",
        "speaker_summary": "Ukrainian partisans claim they have infiltrated a Russian air base and left \"surprises\" for its pilots. This assertion raises the possibility of sabotage and has elicited mixed reactions and speculations online.",
        "duration": 15,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141602.mp3",
        "comments": [
            "Why broadcast it? Just let the “surprise” happen. Now they will be looking for it…",
            "Upper-decked them",
            "I’m chuckling from the image that Ukrainians infiltrated while giggling their way through the base.",
            "Russia can believe it or ignore it.  Their choice to spend time required to check whether the planes have been sabotaged or it may be just a bluff. :P",
            "they probably installed some Boeing parts."
        ],
        "impact": {
            "human_impact": 3,
            "economic_impact": 4,
            "environmental_impact": 2,
            "social_impact": 3,
            "health_impact": 2,
            "infrastructure_impact": 5
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "Relates to the ongoing conflict between Ukraine and Russia, which is a significant global issue.",
                "The report of potential sabotage has generated mixed reactions and discussions online.",
                "The event could have operational impacts on Russian military capabilities, depending on the veracity and extent of the sabotage."
            ]
        }
    },
    {
        "event": "Iran's water crisis leads to ground collapse",
        "speaker_summary": "Iran is experiencing a severe water crisis leading to alarming ground collapses. Over the past 30 years, at least 30 million people have relocated within the country, which is predominantly arid. The situation stresses the urgent need for sustainable water management.",
        "duration": 20,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141608.mp3",
        "comments": [
            "\"At least 30 million people — over a third of Iran's total population of 83 million people — have moved within the country over the last 30 years in the hopes of a better life. Three quarters of Iran's total landmass is considered completely arid.\"\n\nWell. That's terrifying.",
            "If only they had allies that were experts at water technology/sustainability 🤷‍♂️",
            "This is fine, as long as those whores keep their hair covered. Must focus on real problems.",
            "But the regime would rather focus on destroying Israel.",
            "Iran should divert resources that is spent trying to destroy Israel and instead use it on research that will help reverse critical water shortage."
        ],
        "impact": {
            "human_impact": 6,
            "economic_impact": 5,
            "environmental_impact": 7,
            "social_impact": 6,
            "health_impact": 4,
            "infrastructure_impact": 5
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "Highlights a critical environmental and humanitarian issue with significant long-term consequences.",
                "Significant internal migration (30 million people) demonstrates the severity of the crisis.",
                "Direct impacts on various sectors including environmental, social, and economic aspects."
            ]
        }
    },
    {
        "event": "Agencies unearth serious irregularities in Chinese companies' operations in India",
        "speaker_summary": "Indian agencies have discovered serious irregularities in the operations of Chinese companies, including visa issues, tax evasion, and misuse of the e-visa scheme. Some companies falsely claimed \"Make in India\" benefits while heavily relying on Chinese imports.",
        "duration": 20,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141613.mp3",
        "comments": [
            "Submission Statement:\n\nNational security planners have found several irregularities in the operations of Chinese companies and the import of Chinese products into India – ranging from improper documentation for visas, evading local taxes, and bypassing scrutiny by the ministry of home affairs (MHA) -- according to people aware of the matter.\n\nIndian Intelligence and financial investigating agencies have also found that there was large-scale misuse of the e-visa scheme prior to 2020, with some Chinese nationals not only overstaying in India without the mandatory visa renewals but also travelling to the border states and UTs such as Arunachal Pradesh and Jammu & Kashmir, the people added.\n\nWhile officials have been are concerned about the impact of importing billions of dollars worth of furniture, lighting, fixtures and sanitaryware annually from China, and its impact on the local industry – just as Chinese telecom companies flooded the Indian market, setting back domestic phone makers -- a pattern they have observed is some Chinese firms claiming “Make in India” benefits to establish units in India and then importing or sourcing up to 80% parts in those units from China.\n\nThis problem, the officials said, even extends to some Chinese firms that have been operating in the country for roughly two decades. The officials asked that the firms not be named until formal complaints are registered against them and action is initiated.",
            "Why I'm not supreise ?",
            "Chinese people are amazing at getting around rules, as they grew up in a socialist country full of ridiculous rules that people had to get around or avoid if they wanted to live a vaguely normal life",
            "How precise the Indians are with paperwork normally?",
            "If they're common, are they really irregular?"
        ],
        "impact": {
            "human_impact": 2,
            "economic_impact": 4,
            "environmental_impact": 1,
            "social_impact": 3,
            "health_impact": 1,
            "infrastructure_impact": 2
        },
        "exposure": {
            "awareness": 6,
            "awareness_bullet_points": [
                "The event captures attention due to the involvement of significant economic and national security concerns.",
                "Highlights issues relating to tax evasion, misuse of visa schemes, and false claims under the 'Make in India' initiative.",
                "Focuses on Chinese companies operating in India, which is a topic of geopolitical relevance."
            ]
        }
    },
    {
        "event": "China trading with the West lifted billions of their citizens out of poverty, why does China now choose to partner with Russia?",
        "speaker_summary": "China, despite being lifted out of poverty through trade with the West, now partners with Russia for several reasons. The alliance addresses national security concerns and counters Western competition, especially considering ongoing tech and trade wars. This partnership also aligns with China's anti-Western ideological stance promoted since 1989.",
        "duration": 26,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141620.mp3",
        "comments": [
            "Trade is mutually beneficial , it's not someone doing others a favor out the goodness of their heart.",
            "First, China believes the alliance with Russia is a national security issue, which trumps economics. \n\nSecond, China’s trade with the EU (783B) and US (664.5B) combined is only 25% of its total trade (5,936.8B). It’s a big world out there and China isn’t hurting their relationships with the rest of the world by supporting Russia. \n\nhttps://en.m.wikipedia.org/wiki/List_of_the_largest_trading_partners_of_China",
            "Because it cannot partner with the US now.\n\nMany factors (individual leaders, ideologies, history, human rights etc.) play roles in China's foreign policy (and its feuds with the Western world). But China being the second (biggest power) is the most important one.\n\nIt is natural for the US, the currently dominant power, to deter its potential challenger. And it is not unreasonable, China would do the same if it was in US' position. The fact that China is the second is enough for the current hegemony to assume China as an adversary. China's true intentions (very few know), leadership (whether Xi, Hu or Deng), human rights records etc. are less relevant (Be real, many US' allies and friends are doing no better than China in terms of these factors). \n\nSure, China can help to fight Russia. But what is the next after Russia's defeat ? The US (and the West) will be friendly with China again? Those national security concerns will disappear? Advanced chips will be available for China? No, China, as long as remaining the second, will still be deterred, with more resources freed from the European front. So why would China side with the West?",
            "Their ultimate goal is to become a great power, and there are a tech war and trade war going between them and the west. So it is less of a case of choosing to partner with Russia, but more of a case of figuring out that west has became their competitors and you don’t partner with your competitors.",
            "Since 1989, anti-Western ideology has been promoted as insurance against the mainland population wanting Western-style political rights. Russia is very willing to support and offer anti-Western ideology. On the other hand Russia can only offer modest concrete economic or military benefits."
        ],
        "impact": {
            "human_impact": 2,
            "economic_impact": 4,
            "environmental_impact": 1,
            "social_impact": 3,
            "health_impact": 1,
            "infrastructure_impact": 2
        },
        "exposure": {
            "awareness": 7,
            "awareness_bullet_points": [
                "The topic involves significant geopolitical shifts and international relations.",
                "Discussion covers major global economies (China, Russia, the West) with historical and ideological context.",
                "The economic and security considerations discussed are highly relevant to global trade and politics."
            ]
        }
    },
    {
        "event": "Russia to US: Let's Talk, but Ukraine Must Top Agenda",
        "speaker_summary": "Russia has proposed to the U.S. that Ukraine should be the focal point of comprehensive security discussions. Kremlin spokesperson Dmitry Peskov emphasizes the need for broader dialogue on the conflict and global security issues. The U.S., however, maintains that Ukraine must lead any conversation on its future.",
        "duration": 22,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719141626.mp3",
        "comments": [
            "SS:  \n1) Russia is asking for United States to include Ukraine in comprehensive security talks. \n\n2) Dmitry Peskov, a Kremlin representative, is stressing the value of broad discourse that covers the entirety of the conflict as well as wider global security concerns. \n\n3) Presently the Ukraine conversation must be led by Ukraine, however, Americans insist on this showing the underlying complexity in US-Russia relations.",
            "Right now, Russia has what it really wanted, most of the ethnic Russian parts of Ukraine.  While Ukraine might not be able to take much of that back, they can kill an awful lot of Russians with western weapons while trying.\n\nRussia has been signaling for a few months now that they are willing to talk, but the US rightly says it is Ukraine's decision and Ukraine isn't in the mood for that right now.",
            "That's a really good sign. Fighter jets are on the horizon and the aid package helped Ukraine to stabilize the frontlines... there's even rumors about a ukrainian summer offensive. Russia knows that the odds are shifting again, hence these hypocritical, cynical calls for peace talks\n\nNow is definitely not the time to make any concessions towards the invaders",
            "What do Russian leaders want? Security for themselves. But that’s only available within Russia. \n\nOutside Russia, they want continued control over Belarus not a final humiliating defection of their last client state to Europe. But the West can’t guarantee even that for sure.",
            "Turn it into an offramp for Russia to exit Ukraine."
        ],
        "impact": {
            "human_impact": 6,
            "economic_impact": 5,
            "environmental_impact": 2,
            "social_impact": 6,
            "health_impact": 4,
            "infrastructure_impact": 5
        },
        "exposure": {
            "awareness": 9,
            "awareness_bullet_points": [
                "The topic involves significant geopolitical dynamics between major global powers (Russia and the USA) with international implications.",
                "The ongoing conflict in Ukraine is a highly visible and contentious issue, attracting global media attention.",
                "The dialogue proposed by Russia and the response from the U.S. highlight the complexities and stakes involved in international diplomacy and conflict resolution."
            ]
        }
    }
]