[
    {
        "event": "Ongoing Brazil floods raise specter of climate migration",
        "description": "May 20: With hundreds of thousands of families fleeing the floods, the disaster — which has killed at least 147 people — could touch off one of Brazil's biggest cases of climate migration.",
        "speaker_summary": "Severe floods in Brazil have caused hundreds of thousands of families to flee, resulting in at least 147 deaths. The disaster could lead to one of Brazil's largest instances of climate migration.",
        "duration": 15,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136861.mp3"
    },
    {
        "event": "Storms leave widespread outages across Texas, cleanup continues after deadly weekend across U.S.",
        "description": "June 1: Strong storms with damaging winds and baseball-sized hail pummeled Texas on Tuesday, leaving more than one million businesses and homes without power as much of the U.S. recovered from severe weather, including tornadoes that killed at least 24 people in seven states during the Memorial Day holiday weekend.",
        "speaker_summary": "Severe storms with damaging winds and hail hit Texas, causing over a million power outages. Cleanup continues nationwide after Memorial Day weekend tornadoes killed at least 24 people in seven states.",
        "duration": 15,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136865.mp3"
    },
    {
        "event": "Monsoon Season in Pakistan",
        "description": "June 13: Almost 200 people, nearly half of them children, were killed in rain-related incidents during the monsoon season which began in late June. This year's rains have exacerbated the challenging situation following the mega floods of 2022.",
        "speaker_summary": "Monsoon season in Pakistan has killed almost 200 people, nearly half of them children. This year's rains are worsening conditions after the devastating floods of 2022.",
        "duration": 14,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136869.mp3"
    },
    {
        "event": "Earthquake in Haiti",
        "description": "June 21: An earthquake in Haiti in June has posed significant challenges for humanitarian aid, adding to the already dire situation caused by unprecedented levels of gang violence.",
        "speaker_summary": "An earthquake in Haiti on June 21 has compounded humanitarian challenges, worsening the already dire situation caused by rampant gang violence.",
        "duration": 12,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136872.mp3"
    },
    {
        "event": "Wildfires in Australia",
        "description": "May 15: Severe wildfires have ravaged parts of New South Wales, Australia, destroying hundreds of homes and forcing thousands to evacuate. The fires have been attributed to prolonged drought and extreme heat conditions.",
        "speaker_summary": "Severe wildfires in New South Wales, Australia, have destroyed hundreds of homes and forced thousands to evacuate. The fires are linked to prolonged drought and extreme heat conditions.",
        "duration": 13,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136876.mp3"
    },
    {
        "event": "Civil unrest in Sudan",
        "description": "June 5: Ongoing civil unrest in Sudan has led to significant casualties and displacement. The conflict, primarily in the Darfur region, has intensified, with reports of widespread violence and human rights abuses.",
        "speaker_summary": "Ongoing civil unrest in Sudan has led to significant casualties and displacement, primarily in the Darfur region. The conflict has intensified, with widespread violence and human rights abuses reported.",
        "duration": 15,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136880.mp3"
    },
    {
        "event": "Flooding in Germany",
        "description": "May 28: Heavy rains have caused severe flooding in parts of Germany, particularly in the states of Bavaria and Saxony. The floods have resulted in significant property damage and have displaced thousands of residents.",
        "speaker_summary": "Heavy rains have caused severe flooding in Bavaria and Saxony, Germany, leading to major property damage and displacing thousands of residents.",
        "duration": 11,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136883.mp3"
    },
    {
        "event": "Economic crisis in Argentina",
        "description": "June 18: Argentina is facing a severe economic crisis, with inflation rates soaring and widespread protests erupting across major cities. The government has struggled to implement effective measures to stabilize the economy.",
        "speaker_summary": "Argentina is experiencing a severe economic crisis with soaring inflation rates and widespread protests in major cities. The government is struggling to stabilize the economy.",
        "duration": 14,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136887.mp3"
    },
    {
        "event": "Forever 21 asks landlords for rent reduction",
        "description": "June 21: A retailer with more than 380 stores in the U.S. has asked some landlords to cut its rent by as much as 50%.",
        "speaker_summary": "Forever 21, a retailer with over 380 U.S. stores, has requested some landlords to reduce their rent by up to 50%.",
        "duration": 11,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136890.mp3"
    },
    {
        "event": "Heat wave kills over 100 people in India",
        "description": "June 18: Extreme heat has killed more than 100 people in India since March.",
        "speaker_summary": "A severe heat wave in India has killed over 100 people since March.",
        "duration": 7,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136893.mp3"
    },
    {
        "event": "Sidechat app used for protests at U.S. campuses",
        "description": "May 3: Sidechat, an app launched in 2022 where students can post anonymously about their colleges, is becoming a tool for those choosing to protest at U.S. campuses.",
        "speaker_summary": "Sidechat, an app allowing anonymous college posts, is increasingly being used for campus protests across the U.S. Launched in 2022, the app has become a significant tool for student activism.",
        "duration": 15,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136897.mp3"
    },
    {
        "event": "Tensions flare in the South China Sea",
        "description": "June 20: Tensions are flaring once more in the South China Sea.",
        "speaker_summary": "Tensions are escalating in the South China Sea as disputes intensify once again.",
        "duration": 7,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136899.mp3"
    },
    {
        "event": "Heat wave hits New York and the I-95 corridor",
        "description": "June 22: Heat wave shifts to New York and the I-95 corridor as search for more victims in the deadly New Mexico wildfires continues.",
        "speaker_summary": "A heat wave has moved to New York and the I-95 corridor. Meanwhile, efforts continue to find more victims of the deadly wildfires in New Mexico.",
        "duration": 12,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136902.mp3"
    },
    {
        "event": "Bangladesh evacuates hundreds of thousands as a severe cyclone approaches from the Bay of Bengal",
        "description": "May 26: A powerful cyclone has made landfall on India's eastern coast, causing widespread destruction and leading to the evacuation of hundreds of thousands of people.",
        "speaker_summary": "Bangladesh is evacuating hundreds of thousands as a severe cyclone approaches from the Bay of Bengal. The cyclone has already made landfall on India's eastern coast, causing widespread destruction.",
        "duration": 14,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136905.mp3"
    },
    {
        "event": "Major earthquake rocks Japan",
        "description": "June 3: Earthquakes have again struck Japan's north-central region of Ishikawa that is still recovering from the destruction left by a powerful quake on Jan. 1.",
        "speaker_summary": "A major earthquake hit Japan's north-central Ishikawa region, which is still recovering from a powerful quake earlier this year.",
        "duration": 10,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136908.mp3"
    },
    {
        "event": "China launches Sino-French astrophysics satellite, debris falls over populated area",
        "description": "June 22: A Chinese launch of the joint Sino-French SVOM mission to study Gamma-ray bursts early Saturday saw toxic rocket debris fall over a populated area. A Long March 2C rocket lifted off from Xichang Satellite Launch Center at 3:00 a.m. Eastern (0700 UTC) June 22, sending the Space Variable Objects Monitor (SVOM) mission satellite into orbit. .",
        "speaker_summary": "China launched the joint Sino-French SVOM satellite to study Gamma-ray bursts, but toxic rocket debris fell over a populated area. The Long March 2C rocket launched from Xichang Satellite Launch Center early Saturday.",
        "duration": 17,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136913.mp3"
    },
    {
        "event": "Coup-hit Niger was betting on a China-backed oil pipeline as a lifeline. Then the troubles began",
        "description": "June 22: A China-backed pipeline that would make Niger an oil-exporting country is being threatened by an internal security crisis and a diplomatic dispute with neighoring Benin, both as a result of last year's coup that toppled the West African nation's democratic government.",
        "speaker_summary": "Niger's China-backed oil pipeline project faces threats from an internal security crisis and a diplomatic dispute with Benin, following last year's coup that toppled its democratic government.",
        "duration": 14,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136917.mp3"
    },
    {
        "event": "France faces winter power outages due to strikes in 12 out of 18 nuclear plants",
        "description": "June 22: Strikes at nuclear power plants in France have affected 12 of the country's 18 nuclear power plants, raising fears that the country's energy crisis will worsen. Employees at the Chooz-B nuclear power plant in Ardennes city have also joined the strikes that started two weeks ago, causing a reduction in energy production and delays to reactor maintenance.",
        "speaker_summary": "Strikes at 12 of France's 18 nuclear power plants are threatening winter power outages, worsening the energy crisis. Workers, including at the Chooz-B plant, have reduced energy production and delayed reactor maintenance.",
        "duration": 16,
        "audio_url": "https://storage.googleapis.com/backpropagatorsaudios/audio_1719136922.mp3"
    }
]